import 'package:flutter/material.dart';
import 'package:flutter_application_1/Core/extensions/method_ex.dart';
import 'package:flutter_application_1/Core/utils/esay_size.dart';
import 'package:flutter_application_1/gen/assets.gen.dart';

class InfoPage extends StatelessWidget {
  InfoPage({super.key});

  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      length: 3,
      child: Scaffold(
        appBar: AppBar(
          leadingWidth: 180,
          leading: const Padding(
            padding: EdgeInsets.only(right: 12, top: 16),
            child: Text(
              'حول التطبيق',
              style: TextStyle(
                  color: Colors.white,
                  fontSize: 18,
                  fontWeight: FontWeight.bold),
            ),
          ),
          bottom: TabBar(labelColor: Colors.white, tabs: [
            Tab(
              text: 'مركز التبليغ القرآني الدولي'.formatLongLenght(15),
            ),
            Tab(
              text: 'مقدمة الدكتور احمد العابدي'.formatLongLenght(15),
            ),
            Tab(
              text: 'شكر وتقدير'.formatLongLenght(15),
            ),
          ]),
        ),
        body: TabBarView(
          children: [
            itemTab(context, '''بسم الله الحمن الرحيم
الحمدلله رب العالمين 
و الصلاة والسلام على رسول الله و على اله الطاهرين
وأما بعد..

مما لا يختلف عليه اثنان أن سهولة العثور على ما يحتاجه الباحثين والخطباء و أصحاب المنابر الحسينية من مادة علمية متقنة ، قد توفرها بعض التطبيقات الالكترونية  و ذلك لسهولة البحث و التوفير للوقت.

وبعد اطلاعنا على محتوى هذا التطبيق الموسوم "التفسير الموضوعي"
وجدناه نافعا مباركاً و جديداً من نوعه ويمتاز بعدة ميزات لا يُستغنى عنها :

 اولاً : حاول المؤلف أن يأتي بالروايات المتواترة و الصحيحة من حيث السند ويتجنب الضعيف منها في الكتب الغير مشهورة.

ثانياً : اختار من كل صفحة من القرآن الكريم أبرز آياتها وقام بشرحها و تفسيرها معتمدا التفاسير المعتبرة.

ثالثاً : استخدم المؤلف الأسلوب القصصي من أجل التعبير و إيصال المعلومات حيث تلي كلَّ آية مختارة ، قصةٌ ملائمة لموضوعها.

نرى أن هذا الجهد المبارك يلبي طلب ما يحتاجه كل باحث بما فيهم أصحاب الفضيلة الخطباء مع توفير الوقت وسرعة الوصول للمعلومة.

نرجو من الله العلي الأعلى تسديد خُطى الناشطين في نشر تعاليم القرآن وعلوم أهل البيت عليهم السلام ومزيد التوفيق لصاحب هذا الأثر النافع انه سميع مجيب.


مركز التبليغ القراني الدولي
في العتبة الحسينية المقدسة'''),
            itemTab(context, '''مقدمة آية الله الدكتور احمد العابدي (دام ظله)
(رئيس و مؤسس دارالقرآن العلامة الطباطبائي)



بعد أن قام سماحة المفسر و العالم الجليل ذوالفنون الأستاذة آية الله الدكتور احمد العابدي بعد التدقيق و التحقيق في كتاب تحفة الوعاظ، قال:
بسم الله الرحمن الرحيم 
الحمد لله رب العالمين و افضل الصلوات و التحيات على محمد خاتم النبيين و آله الأئمة المعصومين.
النور الهادي الى صراط المستقيم ليس الاّ كتاب الله و كلامه المُنزَل على رسوله محمد صلى الله عليه وآله وسلم و فيه العلم و الحكمة و الاخلاق الحسنة و الآداب الجميلة.
القرآن الكريم هو الكتاب التدويني الإلهي المشتمل على آياته التكوينية و الانفسية ، والغاية القصوى لكل سالكٍ و كادحٍ في سبيل المعارف الإلهيّة الحقة لا تتيسّر الا بالاستضائة من هذا الكتاب الشريف و لايمكن لأحدٍ طي الطريق الى الله تعالى و كشف الحُجُب الظلمانية و النورانية الاّ بمعرفة القرآن الكريم و الاقتباس من هذا الكتاب و هو لايحصل الاّ بعلم التفسير الشريف .
وللتفسير فنونٌ و مناهجٌ كثيرة منها التفسير الموضوعي الذي أبدعها العلامة المجلسي قدس سره في كتابه "بِحارُ الانوار" و بعده أخذ كثير من العلماء في تأليف التفسير الموضوعي ، و منهم سماحة سيد الأعلام و سند الافخام العالم النحرير العلامة الحجة السيد سليم الفاضلي مدّالله تعالى في عمره المبارك ، فقد سلك في أثره القويم أسلوباً بديعاً خاصاً به في التفسير الموضوعي للقرآن الكريم مع الاهتمام بما يهتم به الخطباء و الوعاظ من ذكر بعض غرر الروايات الشريفة و الشواهد التأريخية المفيدة في تبيين المراد من الآيات المنتخبة في كل صفحة و ورقة من القرآن الكريم .
أسأل الله تعالى أن يوفقه لإنجاز و إتمام هذا التفسير القويم و المشروع المبارك و لنشر المعارف القرآنية في المجتمع الإسلامي المبارك.

احمد العابدي 
١٤ /ربيع الثاني/ ١٤٤٢
'''),
            itemTab(context, ''' رسالة شكر وتقدير

إلى من لولاه لساخت الأرض بأهلها، سيدي ومولاي، بقية الله في أرضه، الإمام الحجة المنتظر المهدي أرواحنا لتراب مقدمه الفداء،
لك مني أسمى آيات الشكر والتقدير، فببركتك ورعايتك، تتجلى آمالنا وتزدهر آمال الأمة في ظلالك المباركة.
جزاك الله عنا خير الجزاء، ونسأله تعالى أن يعجل بظهورك وليملأ الأرض قسطاً وعدلاً كما ملئت جوراً وظلماً.
نحن في انتظار الفرج، وكلنا أمل أن تكون خطواتنا في خدمة هذا الدين الطاهر هي من أسباب تعجيل ظهورك الشريف، وأن تقبل منا هذا الجهد المتواضع.

كما أتوجه بأسمى عبارات الشكر والثناء إلى والدي و والدتي و الثلة الطيبة من المؤمنين والمؤمنات الذين ساهموا بجدٍ واجتهاد في إكمال ونشر هذا الأثر القرآني الروائي المبارك، كما ولا شك أن دورهم الكبير في تيسير هذا المشروع المبارك له أجر عظيم عند الله تعالى.
إن ما بذلوه من خدمةٍ و دعم لنشر العلم وتعاليم أهل البيت عليهم السلام هو فخر لنا جميعاً، ونموذج يحتذى به في التضحية والإيثار. أسأل الله أن يضاعف لهم الأجر والثواب، وأن يبارك في أعمالهم، وأن يكون هذا العمل المبارك شفيعاً لهم في الدنيا والآخرة.

نسأل الله تعالى أن يوفقهم جميعاً لما يحب ويرضى، وأن يوفقنا جميعاً في السعي الحثيث نحو رضا الله، وأن يعيننا على السير في طريق الحق والهدى.
اللهم اجعل هذا العمل في ميزان حسناتنا وحسنات جميع من شارك فيه، واجعلنا من المستحقين لدعاء الإمام المهدي عليه السلام.

بارك الله فيكم جميعاً، وجعل أعمالكم في صميم خدمة دين الله، وجعلنا من أنصار الحق والعدل، وأن يُسعد قلوبنا بظهور الفرج القريب.
اللهم آمين.



السيد سليم الفاضلي 
النجف الاشرف 



رابط القناة

حوزة الامام الحجة (ع): 
Hujjahseminary.com

السيد سليم الفاضلي:
https://youtube.com/@salim_alfazeli?si=brhHVsnKnf34BARj'''),
          ],
        ),
      ),
    );
  }

  Widget itemTab(BuildContext context, String text) {
    return SingleChildScrollView(
      child: Column(
        children: [
          Container(
            width: EsaySize.width(context),
            height: 70,
            color: Theme.of(context).primaryColor.withOpacity(0.2),
            child: Row(
              mainAxisAlignment: MainAxisAlignment.spaceEvenly,
              children: logoImages
                  .map(
                    (image) => SizedBox(
                      width: 55,
                      height: 55,
                      child: Image.asset(
                        image,
                      ),
                    ),
                  )
                  .toList(),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(11.0),
            child: SelectableText(
              text,
              style: const TextStyle(fontSize: 17),
            ),
          )
        ],
      ),
    );
  }

  final List<String> logoImages = [
    Assets.images.l1.path,
    Assets.images.l2.path,
    Assets.images.l3.path,
    Assets.images.l4.path,
  ];
}
