import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:flutter_application_1/Core/common/common_snackBar.dart';
import 'package:flutter_application_1/Core/utils/esay_size.dart';
import 'package:flutter_application_1/Features/Settings/presentation/bloc/cubit/settings_cubit.dart';
import 'package:flutter_application_1/Features/Settings/presentation/custom_bottom_sheet.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

class SettingsPage extends StatelessWidget {
  const SettingsPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('الإعدادات',
            style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold)),
      ),
      body: ListView(
        padding: const EdgeInsets.all(16),
        children: [
          _buildSectionTitle('إعدادات التطبيق'),
          _buildSwitchTile(
            context,
            'المظهر الداكن',
            Icons.brightness_6,
          ),
          _buildNavigationTile(context, 'حجم الخط', Icons.text_fields, () {
            showModalBottomSheet(
              context: context,
              builder: (context) {
                return Container(
                  width: EsaySize.width(context),
                  height: EsaySize.height(context) / 2,
                  decoration: const BoxDecoration(
                      borderRadius: BorderRadius.only(
                          topLeft: Radius.circular(8),
                          topRight: Radius.circular(8))),
                  child: Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Column(
                      children: [
                        Container(
                          margin: const EdgeInsets.only(top: 4, bottom: 8),
                          width: 40,
                          height: 5,
                          decoration: BoxDecoration(
                            borderRadius: BorderRadius.circular(8),
                            color: Theme.of(context)
                                .colorScheme
                                .secondary
                                .withOpacity(0.6),
                          ),
                        ),
                        const Padding(
                          padding: EdgeInsets.all(20.0),
                          child: Align(
                            alignment: Alignment.topRight,
                            child: Text(
                              'حجم الخط',
                              style: TextStyle(
                                  fontSize: 24, fontWeight: FontWeight.bold),
                            ),
                          ),
                        ),
                        Padding(
                          padding: const EdgeInsets.all(8.0),
                          child: SliderTheme(
                            data: SliderThemeData(
                                thumbColor:
                                    Theme.of(context).colorScheme.secondary,
                                trackHeight: 2,
                                inactiveTrackColor: Colors.black12,
                                activeTrackColor: Theme.of(context)
                                    .colorScheme
                                    .secondary
                                    .withOpacity(0.6)),
                            child: BlocBuilder<SettingsCubit, SettingsState>(
                              builder: (context, state) {
                                return Slider(
                                  min: 14,
                                  max: 30,
                                  divisions: 16,
                                  label: '${state.fontsize}',
                                  value: state.fontsize,
                                  onChanged: (value) {
                                    BlocProvider.of<SettingsCubit>(context)
                                        .changeFontsize(value);
                                  },
                                );
                              },
                            ),
                          ),
                        ),
                        Padding(
                          padding: const EdgeInsets.all(20.0),
                          child: BlocBuilder<SettingsCubit, SettingsState>(
                            builder: (context, state) {
                              return Text(
                                'بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ ',
                                style: TextStyle(
                                  fontSize: state.fontsize,
                                ),
                              );
                            },
                          ),
                        ),
                        Padding(
                          padding: const EdgeInsets.only(top: 20),
                          child: ElevatedButton(
                              style: ElevatedButton.styleFrom(
                                  backgroundColor:
                                      Theme.of(context).colorScheme.secondary),
                              onPressed: () {
                                Navigator.pop(context);
                              },
                              child: const Text('اغلاق')),
                        )
                      ],
                    ),
                  ),
                );
              },
            );
          }),
          _buildNavigationTile(context, 'نوع الخط', Icons.text_fields, () {
            showModalBottomSheet(
              context: context,
              builder: (context) {
                return Container(
                  width: EsaySize.width(context),
                  height: EsaySize.height(context) / 2,
                  decoration: const BoxDecoration(
                      borderRadius: BorderRadius.only(
                          topLeft: Radius.circular(8),
                          topRight: Radius.circular(8))),
                  child: Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Column(
                      children: [
                        Container(
                          margin: const EdgeInsets.only(top: 4, bottom: 8),
                          width: 40,
                          height: 5,
                          decoration: BoxDecoration(
                            borderRadius: BorderRadius.circular(8),
                            color: Theme.of(context)
                                .colorScheme
                                .secondary
                                .withOpacity(0.6),
                          ),
                        ),
                        const Padding(
                          padding: EdgeInsets.all(20.0),
                          child: Align(
                            alignment: Alignment.topRight,
                            child: Text(
                              'نوع الخط',
                              style: TextStyle(
                                  fontSize: 24, fontWeight: FontWeight.bold),
                            ),
                          ),
                        ),
                        Padding(
                          padding: const EdgeInsets.all(8.0),
                          child: SliderTheme(
                            data: SliderThemeData(
                                thumbColor:
                                    Theme.of(context).colorScheme.secondary,
                                trackHeight: 2,
                                inactiveTrackColor: Colors.black12,
                                activeTrackColor: Theme.of(context)
                                    .colorScheme
                                    .secondary
                                    .withOpacity(0.6)),
                            child: BlocBuilder<SettingsCubit, SettingsState>(
                              builder: (context, state) {
                                return Slider(
                                  min: 1,
                                  max: 3,
                                  divisions: 2,
                                  label: '${state.fontc}',
                                  value: state.fontc,
                                  onChanged: (value) {
                                    BlocProvider.of<SettingsCubit>(context)
                                        .changeFont(value);
                                  },
                                );
                              },
                            ),
                          ),
                        ),
                        Padding(
                          padding: const EdgeInsets.all(20.0),
                          child: BlocBuilder<SettingsCubit, SettingsState>(
                            builder: (context, state) {
                              String s = state.font;
                              s = s.replaceAll('.TTF', '');
                              s = s.replaceAll('.ttf', '');
                              s = s.replaceAll('.otf', '');
                              return Text(
                                'بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ ',
                                style: TextStyle(fontSize: 19, fontFamily: s),
                              );
                            },
                          ),
                        ),
                        Padding(
                          padding: const EdgeInsets.only(top: 20),
                          child: ElevatedButton(
                              style: ElevatedButton.styleFrom(
                                  backgroundColor:
                                      Theme.of(context).colorScheme.secondary),
                              onPressed: () {
                                Navigator.pop(context);
                              },
                              child: const Text('اغلاق')),
                        )
                      ],
                    ),
                  ),
                );
              },
            );
          }),
          divider(context),
          _buildSectionTitle('حول التطبيق'),
          _buildNavigationTile(context, 'عن التطبيق', Icons.info, () {
            showCustomBottomSheet(context, """
التطبيق القرآني يحتوي على أمور، منها:

الأول) تفسير جامع للآيات الموضوعية المختارة من كل صفحة، معتمدا على اكثر من اربعين تفسيرا.

الثاني) ذكر الروايات الشريفة المرتبطة بموضوع الآية المختارة.

الثالث) ذكر الشواهد التاريخية المعتبرة و ذات صلة بموضوع الآية لاسيما حياة الأئمة المعصومين عليهم السلام.

الرابع) بیان معانی بعض مفردات القرآن بعبارة سلسة.

و أسأل الله سبحانه و تعالى أن يتقبل منا هذا العمل المتواضع و يجعله في ميزان حسناتنا يوم لا ينفع مال ولا بنون وأن يكون نافعا لأهل العلم، المبلغين، الأساتذة والمثقفين إن شاء الله تعالى و أسأل الله تعالى لي و لهم التوفيق والسداد و الهدى والرشاد في رحاب القرآن والعترة الطاهرة.

ملاحظات :

١ . يمكنك تكبير وتصغير نصوص التفسيرية كما تشاء.

٢ . يمكنك البحث عن مفردات و عبارات معينة في المصحف الشريف و في التفسير الموضوعي .

۳. في كل صفحة من المصحف تجد أيقونة أسفل الصفحة للتفسير الموضوعي.

٤. المس النجمة في فهرس التفسير ، لحفظ المواضيع المختارة في قسم المفضلة.

 ٥ . يتيح لك خيار "مشاركة و نسخ النص المختار" مع الآخرين .

٦. التطبيق على نسخة الاندرويد و الايفون.

اللَّهُمَّ صَلِّ عَلَى مُحَمَّد وَآلِ مُحَمَّد وَعَجِّل فَرَجَهُم
""");
          }),
          _buildClickableTile(
              context, 'تواصل معنا', Icons.email, 'noralanor6236@gmail.com',
              () {
            Clipboard.setData(
                const ClipboardData(text: 'noralanor6236@gmail.com'));
            CustomSnackBar.show(context, message: 'تم نسخ الإيميل بنجاح');
          }),
          _buildNavigationTile(
              context, 'مصادر التفسير الموضوعي', Icons.menu_book, () {
            showCustomBottomSheet(context, """التفسير

۱. الميزان فى تفسير القرآن، طباطبايى سيد محمد حسين. الناشر: مؤسسة النشر الإسلامي التابعة لجماعة المدرسين في الحوزة العلمية بقم. تاريخ الطبع: ۱٤۱۷ ه. الطبعة: الخامسة. مكان الطبع: قم.
۲. التفسير الوسيط للقرآن الكريم، طنطاوى سيد محمد. الناشر: دار نهضة مصر للطباعة والنشر والتوزيع، الفجالة _ القاهرة الطبعة: الأولى. تاريخ النشر: أجزاء ۱ _ ۳: يناير ۱۹۹۷.
۳-من هدى القرآن، مدرسى سيد محمد تقى. الناشر: دار محبي الحسين. تاريخ الطبع: ۱٤۱۹ ه. الطبعة: الأولى. مكان الطبع: طهران.
٤-التفسير لكتاب الله المنير، كرمى حويزى محمد. الناشر: المطبعة العلمية. تاريخ الطبع: ۱٤۰۲ ه. الطبعة: الأولى. مكان الطبع: قم.
٥-البلاغ فى تفسير القرآن بالقرآن، صادقى تهرانى محمد. الناشر: المؤلف. تاريخ الطبع: ۱٤۱۹ ه. الطبعة: الأولى. مكان الطبع: قم.
٦-معانى القرآن، فراء ابوزكريا يحيى بن زياد. الناشر: دارالمصرية للتأليف و الترجمة. تاريخ الطبع: مجهول. الطبعة: الأولى. مكان الطبع: مصر. التحقيق: أحمد يوسف النجاتي، محمدعلي النجار، عبدالفتاح إسماعيل الشلبي.
۷-لطايف الاشارات، قشيرى عبدالكريم بن هوازن. الناشر: الهيئة المصرية العامة للكتاب. الطبعة: الثالثة. مكان الطبع: مصر. التحقيق: إبراهيم البسيوني.
۸-الكشاف عن حقائق غوامض التنزيل، زمخشرى محمود. الناشر: دار الكتاب العربي. تاريخ الطبع: ۱٤۰۷ ه. الطبعة: الثالثة. مكان الطبع: بيروت.
۹-بيان المعانى، ملاحويش آل غازى عبدالقادر. الناشر: مطبعة الترقي. تاريخ الطبع: ۱۳۸۲ ه. الطبعة: الأولى. مكان الطبع: دمشق.
۱۰-الوجيز في تفسير الكتاب العزيز، دخيل على بن محمد على. الناشر: دار التعارف للمطبوعات. تاريخ الطبع: ۱٤۲۲ ه. الطبعة: الثانية. مكان الطبع: بيروت.
۱۱-الوجيز فى تفسير القرآن العزيز، عاملى على بن حسين. الناشر: دار القرآن الكريم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الأولى. مكان الطبع: قم. التحقيق: الشيخ مالك المحمودي.
۱۲-الجوهر الثمين في تفسير الكتاب المبين، شبر سيد عبد الله. الناشر: مكتبة الألفين. تاريخ الطبع: ۱٤۰۷ ه. الطبعة: الأولى. مكان الطبع: الكويت. التحقيق: مع مقدمة السيد محمد بحر العلوم.
۱۳-التفسير المبين، مغنيه محمد جواد. الناشر: مؤسسة عزالدين. تاريخ الطبع: ۱٤۰۳ ه. الطبعة: الثانيه. مكان الطبع: قم.
۱٤-تفسير القرآن الكريم، شبر سيد عبد الله. الناشر: دار البلاغة للطباعة و النشر. تاريخ الطبع: ۱٤۱۲ ه. الطبعة: الأولى. مكان الطبع: بيروت.
۱٥-تبيين القرآن، حسينى شيرازى سيد محمد الناشر: دار العلوم. تاريخ الطبع: ۱٤۲۳ ه. الطبعة: الثانية. مكان الطبع: بيروت.
۱٦-تفسير ابن عربى، ابن عربى ابو عبدالله محيى الدين محمد الناشر: دار إحياء التراث العربي. تاريخ الطبع: ۱٤۲۲ ه. الطبعة: الأولى. مكان الطبع: بيروت. التحقيق: سمير مصطفى رباب.
۱۷-مفاتيح الغيب، فخرالدين رازى ابوعبدالله محمد بن عمر. الناشر: دار إحياء التراث العربي. تاريخ الطبع: ۱٤۲۰ ه. الطبعة: الثالثة. مكان الطبع: بيروت.
۱۸-زاد المسير فى علم التفسير، ابن جوزى ابوالفرج عبدالرحمن بن على. الناشر: دار الكتاب العربي. تاريخ الطبع: ۱٤۲۲ ه. الطبعة: الأولى. مكان الطبع: بيروت. التحقيق: عبدالرزاق المهدي.
۱۹-روح المعانى فى تفسير القرآن العظيم، آلوسى سيد محمود الناشر: دار الكتب العلمية. تاريخ الطبع: ۱٤۱٥ ه. الطبعة: الأولى. مكان الطبع: بيروت. التحقيق: علي عبد الباري عطية.
۲۰-الدر المنثور فى تفسير المأثور، سيوطى جلال الدين الناشر: مكتبة آية الله المرعشي النجفي. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الاولى. مكان الطبع: قم.
۲۱-جامع البيان فى تفسير القرآن، طبرى ابو جعفر محمد بن جرير. الناشر: دار المعرفة. تاريخ الطبع: ۱٤۱۲ ه. الطبعة: الأولى. مكان الطبع: بيروت.
۲۲-تفسير المراغي، أحمد مصطفى المراغي، ط ۲، دار إحياء التراث العربي، بيروت ۱۹۸٥ م.
۲۳-التبيان فى تفسير غريب القرآن، ابن هائم شهاب الدين احمد بن محمد. الناشر: دار الغرب الإسلامي. تاريخ الطبع: ۱٤۲۳ ه. الطبعة: الأولى. مكان الطبع: بيروت.
۲٤-بحرالعلوم، سمرقندى نصربن محمد بن احمد. الناشر: دار الكتب العلمية. سنة النشر: ۱٤۱۳ _ ۱۹۹۳. عدد المجلدات: ۳. رقم الطبعة: ۱.
۲٥-مجمع البيان فى تفسير القرآن، طبرسى فضل بن حسن. الناشر: منشورات ناصر خسرو. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الثالث. مكان الطبع: طهران. التحقيق: مع مقدمة محمد جواد البلاغي.
۲٦-زبدة التفاسير، كاشانى ملا فتح الله. الناشر: مؤسسة المعارف الإسلامية. تاريخ الطبع: ۱٤۲۳ ه. الطبعة: الأولى. مكان الطبع: قم.. التحقيق: مؤسسة المعارف الإسلامية.
۲۷-روض الجنان و روح الجنان فى تفسيرالقرآن، ابوالفتوح رازى حسين بن على. الناشر: مؤسسة الدراسات الإسلامية في الروضة الرضوية المقدسة. تاريخ الطبع: ۱٤۰۸ ه. الطبعة:. مكان الطبع: مشهد. التحقيق: الدكتور محمد جعفر ياحقي _ الدكتور محمد مهدي ناصح.
۲۸-تفسير نور الثقلين، عروسى حويزى عبد على بن جمعه. الناشر: منشورات إسماعيليان. تاريخ الطبع: ۱٤۱٥ ه. الطبعة: الرابعة. مكان الطبع: قم. التحقيق: السيد هاشم رسولي محلاتي.
۲۹-تفسير القمى، قمى على بن ابراهيم. الناشر: دار الكتاب. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الرابعة. مكان الطبع: قم. التحقيق: السيد طيب الموسوي الجزائري.
۳۰-تفسير فرات الكوفى، فرات كوفى ابوالقاسم فرات بن ابراهيم، وزارة الثقافة و الإرشاد الإسلامي، مؤسسة الطبع و النشر. مكان الطبع طهران _ ایران. سنة الطبع: ۱٤۱۰ ق. الطبعة: ۱.
۳۱-تفسير خسروى، ميرزا خسروانى على رضا. الناشر: المنشورات الإسلامية. تاريخ الطبع: ۱۳۹۰ ه. الطبعة: الأولى. مكان الطبع: طهران. التحقيق: محمد باقر بهبودي.
۳۲-تفسير جوامع الجامع، طبرسى فضل بن حسن. الناشر: منشورات جامعة طهران و إدارة الحوزة العلمية بقم. تاريخ الطبع: ۱٤۱۸ ه. الطبعة: الأولى. مكان الطبع: طهران.
۳۳-تفسير جامع، بروجردى سيد محمد ابراهيم. الناشر: منشورات الصدر. تاريخ الطبع: ۱٤۰۷ ه. الطبعة: السادسة مكان الطبع: طهران.
۳٤-تفسير المعين، كاشانى محمد بن مرتضى. الناشر: مكتبة آية الله المرعشي النجفي. تاريخ الطبع: ۱٤۱۰ ه. الطبعة: الأولى. مكان الطبع: قم. التحقيق: حسين درگاهي.
۳٥-تفسير الكاشف، مغنيه محمد جواد. الناشر: دار الكتب الإسلامية. تاريخ الطبع: ۱٤۲٤ ه. الطبعة: الأولى. مكان الطبع: طهران.
۳٦-تفسير الصافى، فيض كاشانى ملا محسن. الناشر: منشورات الصدر. تاريخ الطبع: ۱٤۱٥ ه. الطبعة: الثانية. مكان الطبع: طهران. التحقيق: حسين الأعلمي.
۳۷-تفسير التبيان، الشيخ الطوسي، تحقيق أحمد حبيب قصير العاملي، دار إحياء التراث العربي، بيروت. التحقيق: مع مقدمة الشيخ آغابزرگ الطهراني و تحقيق أحمد قصير العاملي.
۳۸-تأويل الآيات الظاهرة، حسينى استرآبادى سيد شرف الدين على. الناشر: مؤسسة النشر الإسلامي التابعة لجماعة المدرسين في الحوزة العلمية بقم. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الأولى. مكان الطبع: قم.
۳۹-الأمثل فى تفسير كتاب الله المنزل، مكارم شيرازى ناصر. الناشر: مدرسة الإمام علي بن أبي طالب#. تاريخ الطبع: ۱٤۲۱ ه. الطبعة: الأولى. مكان الطبع: قم.
٤۰-تفسير التسنيم، المؤلف الشيخ عبدالله الجوادي الطبري الاملي. الناشردار الاسراء للنشر. الطبعة الثانية ۲۰۱۱م. التحقيق الشيخ محمد عبد المنعم الخاقاني. التعريب السيد عبد المطلب رضا.
٤۱-تفسير البرهان، اسم المؤلف: البحراني، السيد هاشم. الناشر: مؤسسة البعثة. تاريخ الطبع: ۱٤۱٦ ه. الطبعة: الأولى. مكان الطبع: طهران. التحقيق: قسم الدراسات الإسلامية، موسسة البعثة _ قم.
٤۲-التفسير المنسوب إلى الإمام الحسن العسكري#، المؤلف: الحسن بن علي#، الإمام الحادي عشر. تاريخ وفاة المؤلف: ۲٦۰ ه. محقق، مصحح: مدرسة الإمام المهدي عجل الله تعالى فرجه الشريف. الناشر: مدرسة الإمام المهدي عجّل الله تعالى فرجة الشريف. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الأولى.
٤۳-تفسير العيّاشي، المؤلف: العياشى، محمد بن مسعود. تاريخ وفاة المؤلف: ۳۲۰ ه. محقق / مصحح: رسولي محلاتي، هاشم. الناشر: المطبعة العلمية. مكان الطبع: طهران. تاريخ الطبع: ۱٤۲۲ ه. الطبعة: الأولى.
٤٤-مفردات ألفاظ القرآن، المؤلف: الراغب الأصفهاني، حسين بن محمد. تاريخ وفاة المؤلف: ٤۰۱ ه. الناشر: دار القلم _ الدار الشامية. مكان الطبع: بيروت _ دمشق. تاريخ الطبع: ۱٤۱۲ ه. الطبعة: الأولى.

مصادر الروائية والتأريخية

۱. بحار الأنوار الجامعة لدرر أخبار الأئمة الأطهار (ط _ بيروت)، المؤلف: المجلسي، محمد باقر بن محمد تقي. الناشر: دار إحياء التراث العربي. مكان الطبع: بيروت. تاريخ الطبع: ۱٤۰۳ ه. الطبعة: الثانية.
    ۲. الكافي (ط _ الإسلامية) /المؤلف: الكليني، محمد بن يعقوب بن إسحاق. تاريخ وفاة المؤلف: ۳۲۹ ه. محقق، مصحح: غفاري، علي أكبر وآخوندي، محمد. الناشر: دار الكتب الإسلامية. مكان الطبع: طهران. تاريخ الطبع: ۱٤۰۷ ه. الطبعة: الرابعة.
  ۳. الكافي (ط _ دار الحديث) المؤلف: الكليني، محمد بن يعقوب بن إسحاق. محقق، مصحح: دار الحديث. الناشر: دار الحديث. مكان الطبع: قم. تاريخ الطبع: ۱٤۲۹ ه. الطبعة: الأولى.
٤. كتاب سليم بن قيس الهلالي، المؤلف: الهلالي، سليم بن قيس. تاريخ وفاة المؤلف: ۷٦ ه. محقق، مصحح: الأنصاري الزنجاني الخوئيني، محمد. الناشر: الهادي. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۰٥ ه. الطبعة: الأولى.
٥. الصحيفة السجادية، المؤلف: علي بن الحسين#، الإمام الرابع. تاريخ وفاة المؤلف: ۹٤ أو ۹٥ ه. الناشر: نشر الهادي. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۸ ه. الطبعة: الأولى.
٦. مصباح الشريعة، المؤلف: منسوب إلى جعفر بن محمد#، الإمام السادس. تاريخ وفاة المؤلف: ۱٤۸ ه. الناشر: الأعلمي. مكان الطبع: بيروت. تاريخ الطبع: ۱٤۰۰ ه. الطبعة: الأولى.
۷. وقعة الطفّ، المؤلف: أبو مخنف الكوفي، لوط بن يحيى. تاريخ وفاة المؤلف: ۱٥۸ ه. محقق، مصحح: اليوسفي الغروي، محمد هادي. الناشر: جماعة المدرسين. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۷ ه. الطبعة: الثالثة.
۸. توحيد المفضل، المؤلف: المفضل بن عمر. تاريخ وفاة المؤلف: ۱٤۸ ه. محقق، مصحح: المظفر، كاظم. الناشر: داوري. مكان الطبع: إيران؛ قم. الطبعة: الثالثة.
۹. وقعة صفين، المؤلف: نصر بن مزاحم. تاريخ وفاة المؤلف: ۲۱۲ ه. محقق، مصحح: هارون، عبد السلام محمد. الناشر: مكتبة آية الله المرعشي النجفي. مكان الطبع: قم. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الثانية.
۱۰. الزهد، المؤلف: الكوفي الأهوازي، حسين بن سعيد. تاريخ وفاة المؤلف: القرن ۳. محقق، مصحح: عرفانيان يزدي، غلام رضا. الناشر: المطبعة العلمية. مكان الطبع: قم. تاريخ الطبع: ۱٤۰۲ ه. الطبعة: الثانية.
۱۱. المؤمن، المؤلف: الكوفي الأهوازي، حسين بن سعيد. تاريخ وفاة المؤلف: القرن ۳. الناشر: مؤسسة الإمام المهدي#. مكان الطبع: قم. تاريخ الطبع: ۱٤۰٤ ه.
۱۲. المحاسن، المؤلف: البرقي، أحمد بن محمد بن خالد. تاريخ وفاة المؤلف: ۲۷٤ ه أو ۲۸۰ ه. محقق، مصحح: المحدث، جلال الدين. الناشر: دار الكتب الإسلامية. مكان الطبع: قم. تاريخ الطبع: ۱۳۷۱ ه. الطبعة: الثانية.
۱۳. بلاغات النساء، المؤلف: ابن أبي طاهر، أحمد بن أبي طاهر. تاريخ وفاة المؤلف: ۲۸۰ ه. الناشر: الشريف الرضي. مكان الطبع: قم. الطبعة: الأولى.
۱٤. بصائر الدرجات في فضائل آل محمّد صلّى الله عليهم، المؤلف: الصفار، محمد بن حسن. تاريخ وفاة المؤلف: ۲۹۰ ه. محقق، مصحح: كوچه باغي، محسن بن عباس علي. الناشر: مكتبة آية الله المرعشي النجفي. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الثانية.
۱٥. الروضة من الكافي، ترجمة رسولي محلاتي، المؤلف: الكليني، محمد بن يعقوب. تاريخ وفاة المؤلف: ۳۲۹ ه. المترجم: رسولي محلاتي، هاشم. محقق، مصحح: غفاري، علي أكبر. الناشر: منشورات العلمية الإسلامية. مكان الطبع: طهران. تاريخ الطبع: ۱٤۰٥ ه.
۱٦. فضائل أمير المؤمنين#، المؤلف: ابن عقدة الكوفي، أحمد بن محمد. تاريخ وفاة المؤلف: ۳۳۲ ه. محقق، مصحح: حرز الدين، عبد الرزاق محمد حسين. الناشر: دليل ما. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۲٤ ه. الطبعة: الأولى.
۱۷. إثبات الوصية للإمام عليّ بن أبي طالب، المؤلف: المسعودي، على بن الحسين. تاريخ وفاة المؤلف: ۳٤٦ ه. الناشر: أنصاريان. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۲٦ ه. الطبعة: الثالثة.
۱۸. كفاية الأثر في النصّ على الأئمة الإثني عشر، المؤلف: الخزاز الرازى، علي بن محمد. تاريخ وفاة المؤلف: القرن ٤. محقق، مصحح: الحسيني الكوهكمري، عبد اللطيف. الناشر: بيدار. مكان الطبع: قم. تاريخ الطبع: ۱٤۰۱ ه.
۱۹. تحف العقول عن آل الرسول&، المؤلف: ابن شعبة الحراني، الحسن بن علي. تاريخ وفاة المؤلف: القرن ٤. محقق، مصحح: غفاري، علي أكبر. الناشر: جماعة المدرسين. مكان الطبع: قم. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الثانية.
۲۰. الغيبة (للنعماني)، المؤلف: ابن أبي زينب، محمد بن إبراهيم. تاريخ وفاة المؤلف: ۳٦۰ ه. محقق، مصحح: غفاري، علي أكبر. الناشر: نشر الصدوق. مكان الطبع: طهران. تاريخ الطبع: ۱۳۹۷ ه. الطبعة: الأولى.
۲۱. شرح الأخبار في فضائل الأئمة الأطهار%، المؤلف: ابن حيون، النعمان بن محمد. تاريخ وفاة المؤلف: ۳٦۳ ه. محقق، مصحح: الحسيني الجلالي، محمد حسين. عدد المجلدات: ۳. الناشر: جماعة المدرسين بقم، مؤسسة النشر الإسلامي. مكان الطبع: قم. تاريخ الطبع: ۱٤۰۹ ه.
۲۲. كامل الزيارات، المؤلف: ابن قولويه، جعفر بن محمد. تاريخ وفاة المؤلف: ۳٦۷ ه. محقق، مصحح: الأميني، عبد الحسين. الناشر: دار المرتضوية. مكان الطبع: النجف. تاريخ الطبع: ۱۳۹۷ ه. الطبعة: الأولى.
۲۳. من لا يحضره الفقيه، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. محقق، مصحح: غفاري، علي أكبر. الناشر: مؤسسة النشر الإسلامي التابعة لجماعة المدرسين بقم. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الثانية.
۲٤. الأمالي (للصدوق)، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. الناشر: كتابچى. مكان الطبع: طهران. تاريخ الطبع: ۱٤۱۸ ه. الطبعة: السادسة.
۲٥. ثواب الأعمال وعقاب الأعمال، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. الناشر: دار الشريف الرضي للنشر. مكان الطبع: قم. تاريخ الطبع: ۱٤۰٦ ه. الطبعة: الثانية.
۲٦. الخصال، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. محقق، مصحح: غفاري، علي أكبر. الناشر: جماعة المدرسين. مكان الطبع: قم. تاريخ الطبع: ۱٤۰۳ ه. الطبعة: الأولى.
۲۷. صفات الشيعة، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. الناشر: الأعلمي. مكان الطبع: طهران. تاريخ الطبع: ۱٤۰۳ ه. الطبعة: الأولى.
۲۸. فضائل الشيعة، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. الناشر: الأعلمي. مكان الطبع: طهران. الطبعة: الأولى.
۲۹. معاني الأخبار، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. محقق، مصحح: غفاري، علي أكبر. الناشر: مؤسسة النشر الإسلامي التابعة لجماعة المدرسين بقم. مكان الطبع: قم. تاريخ الطبع: ۱٤۰۳ ه. الطبعة: الأولى.
۳۰. علل الشرائع، المؤلف: ابن بابويه، محمد بن علي. تاريخ وفاة المؤلف: ۳۸۱ ه. الناشر: مكتبة داوري. مكان الطبع: قم. تاريخ الطبع: ۱٤۲۷ ه. الطبعة: الأولى.
۳۱. الاختصاص، المؤلف: المفيد، محمد بن محمد. تاريخ وفاة المؤلف: ٤۱۳ ه. محقق، مصحح: غفاري، علي أكبر ومحرمي زرندي، محمود. الناشر: الموتمر العالمي لألفية الشيخ المفيد. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الأولى.
۳۲. كتاب المزار _ مناسك المزار (للمفيد)، المؤلف: المفيد، محمد بن محمد. تاريخ وفاة المؤلف: ٤۱۳ ه. محقق، مصحح: الأبطحي، محمد باقر. الناشر: مؤتمر ألفية الشيخ المفيد _ رحمة الله عليه. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الأولى.
۳۳. الإرشاد في معرفة حجج الله على العباد، المؤلف: المفيد، محمد بن محمد. تاريخ وفاة المؤلف: ٤۱۳ ه. محقق، مصحح: مؤسسة آل البيت%. الناشر: مؤتمر الشيخ المفيد. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الأولى.
۳٤. الأمالي (للمفيد)، المؤلف: المفيد، محمد بن محمد. تاريخ وفاة المؤلف: ٤۱۳ ه. محقق، مصحح: أستاد ولي، حسين وغفاري علي أكبر. الناشر: مؤتمر الشيخ المفيد. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الأولى.
۳٥. أمالي المرتضى (غرر الفوائد ودرر القلائد)، المؤلف: علم الهدى، علي بن الحسين. تاريخ وفاة المؤلف: ٤۳٦ ه. محقق، مصحح: إبراهيم، محمد أبو الفضل. الناشر: دار الفكر العربي. مكان الطبع: القاهرة. تاريخ الطبع: ۱۹۹۸ م. الطبعة: الأولى.
۳٦. كنز الفوائد، المؤلف: الكراجكي، محمد بن علي. تاريخ وفاة المؤلف: ٤٤۹ ه. محقق، مصحح: نعمة، عبد الله. الناشر: دار الذخائر. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۰ ه. الطبعة: الأولى.
۳۷. دلائل الإمامة (ط _ حديثة)، المؤلف: الطبري الآملي الصغير، محمد بن جرير بن رستم. تاريخ وفاة المؤلف: القرن ٥. محقق، مصحح: قسم الدراسات الإسلامية مؤسسة البعثة. الناشر: البعثة. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الأولى.
۳۸. تهذيب الأحكام المؤلف: الطوسي، محمد بن الحسن. تاريخ وفاة المؤلف: ٤٦۰ ه. محقق، مصحح: الخرسان، حسن الموسوي. الناشر: دار الكتب الإسلاميه. مكان الطبع: طهران. تاريخ الطبع: ۱٤۰۷ ه. الطبعة: الرابعة.
۳۹. الاستبصار فيما اختلف من الأخبار، المؤلف: الطوسي، محمد بن الحسن. تاريخ وفاة المؤلف: ٤٦۰ ه. محقق، مصحح: الخرسان، حسن الموسوي. الناشر: دار الكتب الإسلامية. مكان الطبع: طهران. تاريخ الطبع: ۱۳۹۰ ه. الطبعة: الأولى.
٤۰. شواهد التنزيل لقواعد التفضيل، المؤلف: الحسكاني، عبيد الله بن عبدالله. تاريخ وفاة المؤلف: ٤۹۰ ه. محقق، مصحح: محمودي، محمد باقر. الناشر: مجمع إحياء الثقافة الإسلامية التابعة لوزارة الثقافة والإرشاد الإسلامي. مكان الطبع: طهران. تاريخ الطبع: ۱٤۱۱ ه. الطبعة: الأولى.

٤۱. روضة الواعظين وبصيرة المتعظين (ط _ قديمة)، المؤلف: فتال النيشابوري، محمد بن أحمد. تاريخ وفاة المؤلف: ٥۰۸ ه. الناشر: منشورات الرضي. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۷ ه. الطبعة: الأولى.
٤۲. إعلام الورى بأعلام الهدى (ط _ قديمة)، المؤلف: الطبرسي، الفضل بن الحسن. تاريخ وفاة المؤلف: ٥٤۸ ه. الناشر: الإسلامية. مكان الطبع: طهران. تاريخ الطبع: ۱۳۹۰ ه. الطبعة: الثالثة.
٤۳. غرر الحكم ودرر الكلم، المؤلف: التميمي الآمدي، عبد الواحد بن محمد. تاريخ وفاة المؤلف: ٥٥۰ ه. محقق، مصحح: رجائي، السيد مهدي. عدد المجلدات: ۱. الناشر: دار الكتاب الإسلامي. مكان الطبع: قم.
٤٤. جامع الأخبار (للشعيري)، المؤلف: الشعيري، محمد بن محمد. تاريخ وفاة المؤلف: القرن ٦. الناشر: المطبعة الحيدرية. مكان الطبع: النجف. الطبعة: الأولى.
٤٥. مكارم الأخلاق، المؤلف: الطبرسي، الحسن بن الفضل. تاريخ وفاة المؤلف: القرن ٦. الناشر: الشريف الرضي. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۲ ه. الطبعة: الرابعة.
٤٦. بشارة المصطفى لشيعة المرتضى (ط _ قديمة)، المؤلف: الطبري الآملي، عماد الدين أبو جعفر محمد بن أبي القاسم. تاريخ وفاة المؤلف: ٥٥۳ ه. الناشر: المكتبة الحيدرية. مكان الطبع: النجف. تاريخ الطبع: ۱۳۸۲ ه. الطبعة: الثانية.
٤۷. الثاقب في المناقب، المؤلف: ابن حمزة الطوسي، محمد بن علي. تاريخ وفاة المؤلف: حي في ٥٦٦ ه. محقق، مصحح: علوان، نبيل رضا. الناشر: أنصاريان. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۹ ق. الطبعة: الثالثة.
٤۸. النوادر (للراوندي)، المؤلف: الراوندي الكاشاني، فضل الله بن علي. تاريخ وفاة المؤلف: ٥۷۰ ه. محقق، مصحح: صادقي أردستاني، أحمد. الناشر: دار الكتاب. مكان الطبع: إيران؛ قم. الطبعة: الأولى.
٤۹. قصص الأنبياء% (للراوندي)، المؤلف: قطب الدين الراوندي، سعيد بن هبة الله. تاريخ وفاة المؤلف: ٥۷۳ ه. محقق، مصحح: عرفانيان يزدي، غلام رضا. الناشر: مركز الدراسات الإسلامية. مكان الطبع: مشهد. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الأولى.
٥۰. الخرائج والجرائح، المؤلف: قطب الدين الراوندي، سعيد بن هبة الله. تاريخ وفاة المؤلف: ٥۷۳ ه. محقق، مصحح: مؤسسة الإمام المهدى#. الناشر: مؤسسة الإمام المهدي عجل الله تعالى فرجه الشريف. مكان الطبع: قم. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الأولى.
٥۱. مناقب آل أبي طالب% (لابن شهرآشوب)، المؤلف: ابن شهرآشوب المازندراني، محمد بن علي. تاريخ وفاة المؤلف: ٥۸۸ ه. الناشر: علامة. مكان الطبع: قم. تاريخ الطبع: ۱٤۲۱ ه. الطبعة: الأولى.
٥۲. الاحتجاج على أهل اللجاج (للطبرسي)، المؤلف: الطبرسي، أحمد بن علي. تاريخ وفاة المؤلف: ٥۸۸ ه. محقق، مصحح: الخرسان، محمد باقر. الناشر: نشر المرتضى. مكان الطبع: مشهد. تاريخ الطبع: ۱٤۰۳ ه. الطبعة: الأولى.
٥۳. الفضائل (لابن شاذان القمي)، المؤلف: ابن شاذان القمي، أبو الفضل شاذان بن جبرئيل. تاريخ وفاة المؤلف: حدود ٦۰۰ ه. الناشر: الرضي. مكان الطبع: قم. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الثانية.
٥٥. مشكاة الأنوار في غرر الأخبار، المؤلف: الطبرسي، علي بن الحسن. تاريخ وفاة المؤلف: ٦۰۰ ه. الناشر: المكتبة الحيدرية. مكان الطبع: النجف. تاريخ الطبع: ۱۳۸٥ ه. الطبعة: الثانية.
٥٦. مجموعه ورّام، آداب واخلاق در اسلام، ترجمة تنبيه الخواطر، المؤلف: ورام بن أبي فراس، مسعود بن عيسى. تاريخ وفاة المؤلف: ٦۰٥ ه. المترجم: عطائي، محمد رضا. الناشر: مجمع البحوث الإسلامية في الروضة الرضوية المقدسة. مكان الطبع: مشهد. تاريخ الطبع: ۱٤۱۱ ه. الطبعة: الأولى.
٥۷. شرح نهج البلاغة لابن أبي الحديد، المؤلف: ابن أبي الحديد، عبد الحميد بن هبة الله. تاريخ وفاة المؤلف: ٦٥٦ ه. محقق، مصحح: إبراهيم، محمد أبو الفضل. الناشر: مكتبة آية الله المرعشي النجفي. مكان الطبع: قم. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الأولى.
٥۸. إقبال الأعمال (ط _ قديمة)، المؤلف: ابن طاووس، علي بن موسى. تاريخ وفاة المؤلف: ٦٦٤ ه. الناشر: دار الكتب الإسلاميه. مكان الطبع: طهران. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الثانية.
٥۹. اللهوف على قتلى الطفوف، ترجمة الفهري‌/المؤلف: ابن طاووس، علي بن موسى، تاريخ وفاة المؤلف: ٦٦٤ ه‌/المترجم: الفهري الزنجاني، أحمد. الناشر: جهان. مكان الطبع: طهران. تاريخ الطبع: ۱۳۸۹ ه. الطبعة: الأولى.
٦۰. مهج الدعوات ومنهج العبادات، المؤلف: ابن طاووس، علي بن موسى. تاريخ وفاة المؤلف: ٦٦٤ ه. محقق، مصحح: الكرماني، أبو طالب والمحرر، محمد حسن. الناشر: دار الذخائر. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۱ ه. الطبعة: الأولى.
٦۱. كشف الغمة في معرفة الأئمة (ط _ قديمة)، المؤلف: الإربلي، علي بن عيسى. تاريخ وفاة المؤلف: ٦۹۲ ه. محقق، مصحح: رسولي محلاتي، هاشم. الناشر: بني هاشمي. مكان الطبع: تبريز. تاريخ الطبع: ۱٤۲۳ ه. الطبعة: الأولى.
٦۲. الدر النظيم فى مناقب الأئمة اللهاميم، المؤلف: الشامي، يوسف بن حاتم. تاريخ وفاة المؤلف: القرن السابع. عدد المجلدات: ۱. الناشر: جماعة المدرسين بقم، مؤسسة النشر الإسلامي. مكان الطبع: قم. تاريخ الطبع: ۱٤۲۰ ه. الطبعة: الأولى.
٦۳. كشف اليقين فى فضائل أمير المؤمنين#، المؤلف: العلامة الحلي، الحسن بن يوسف بن مطهر. تاريخ وفاة المؤلف: ۷۲٦ ه. محقق، مصحح: درگاهى، حسين. الناشر: وزارة الإرشاد. مكان الطبع: طهران. تاريخ الطبع: ۱٤۱۱ ه. الطبعة: الأولى.
٦٤. إرشاد القلوب إلى الصواب (للديلمي)، المؤلف: الديلمي، حسن بن محمد. تاريخ وفاة المؤلف: ۸٤۱ ه. الناشر: الشريف الرضي. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۲ ه. الطبعة: الأولى.
٦٥. غرر الأخبار ودرر الآثار في مناقب أبي الأئمة الأطهار%، المؤلف: الديلمي، حسن بن محمد. تاريخ وفاة المؤلف: ۸٤۱ ه. محقق، مصحح: ضيغم، إسماعيل. الناشر: دليل ما. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۲۷ ه. الطبعة: الأولى.
٦٦. مثير الأحزان‌/المؤلف: ابن نما الحلي، جعفر بن محمد. تاريخ وفاة المؤلف: ۸٤۱ ه. محقق، مصحح: مدرسة الإمام المهدي عجل الله تعالى فرجه الشريف. الناشر: مدرسة الإمام المهدي عجّل الله تعالى فرجة الشريف. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۰٦ ه. الطبعة: الثالثة.
٦۷. المصباح للكفعمي (جنة الأمان الواقية وجنة الإيمان الباقية)، المؤلف: الكفعمي، إبراهيم بن علي العاملي. تاريخ وفاة المؤلف: ۹۰٥ ه. الناشر: دار الرضي (زاهدي). مكان الطبع: قم. تاريخ الطبع: ۱٤۰٥ ه. الطبعة: الثانية.
٦۸. ديوان أمير المؤمنين#، المؤلف: الميبدي، حسين بن معين الدين. تاريخ وفاة المؤلف: ۹۱۱ ه. المترجم: زماني، مصطفى. محقق، مصحح: زماني، مصطفى. الناشر: دار نداء الإسلام للنشر. مكان الطبع: قم. تاريخ الطبع: ۱٤۱۱ ه.
٦۹. تسلية المُجالس وزينة المَجالس (مقتل الحسين#)، المؤلف: الحسينى الموسوي، محمد بن أبي طالب. تاريخ وفاة المؤلف: القرن ۱۰. محقق، مصحح: الحسون، كريم فارس. الناشر: مؤسسة المعارف الإسلامية. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۸ ه. الطبعة: الأولى.
۷۰. منية المريد، المؤلف: الشهيد الثاني، زين الدين بن علي‌اريخ وفاة المؤلف: ۹٦٦ ه‌محقق، مصحح: مختاري، رضا. الناشر: مكتب الإعلام الإسلامي.‌كان الطبع: قم. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الأولى.
۷۱. الصوارم المُهرقة في نقد الصواعق المُحرقة (لابن حجر الهيثمي)، المؤلف: الشوشتري، نور الله بن شريف الدين. تاريخ وفاة المؤلف: ۱۰۱۹ ه. الناشر: مطبعة النهضة. مكان الطبع: طهران. تاريخ الطبع: ۱۳٦۷ ه. الطبعة: الأولى.
۷۲. الوافي، المؤلف: الفيض الكاشاني، محمد محسن بن مرتضى. تاريخ وفاة المؤلف: ۱۰۹۱ ه. الناشر: مكتبة الإمام أمير المؤمنين علي#. مكان الطبع: أصفهان. تاريخ الطبع: ۱٤۰٦ ه. الطبعة: الأولى.
۷۳. مدينة معاجز الأئمة الإثني عشر ودلائل الحجج على البشر، المؤلف: البحراني، السيد هاشم بن سليمان. تاريخ وفاة المؤلف: ۱۱۰۷ ه. الناشر: مؤسسة المعارف الإسلامية. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۱۳ ه. الطبعة: الأولى.
۷٤. مرآة العقول في شرح أخبار آل الرسول، المؤلف: المجلسي، محمد باقر بن محمد تقي. تاريخ وفاة المؤلف: ۱۱۱۰ ه. محقق، مصحح: رسولي محلاتي، هاشم. الناشر: دار الكتب الإسلامية. مكان الطبع: طهران. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الثانية.
۷٥. زاد المعاد _ مفتاح الجنان، المؤلف: المجلسي، محمد باقر بن محمد تقي. تاريخ وفاة المؤلف: ۱۱۱۰ ه. محقق، مصحح: الأعلمي، علاء الدين. عدد المجلدات: ۱. الناشر: موسسة الأعلمي للمطبوعات. مكان الطبع: بيروت. تاريخ الطبع: ۱٤۲۳ ه.
۷٦. النور المبين في قصص الأنبياء والمرسلين (للجزائري)، المؤلف: الجزائري، نعمة الله بن عبد الله. تاريخ وفاة المؤلف: ۱۱۱۲ ه. الناشر: مكتبة آية الله المرعشي النجفي. مكان الطبع: قم. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الأولى.
۷۷. قصص الأنبياء (ترجمة قصص الأنبياء للجزائري)، المؤلف: الجزائري، نعمة الله بن عبد الله. تاريخ وفاة المؤلف: ۱۱۱۲ ه. المترجم: مشايخ، فاطمة.. الناشر: منشورات فرحان. مكان الطبع: طهران. تاريخ الطبع: ۱٤۲۳ ه. الطبعة: الأولى.
۷۸. كشف الأسرار في شرح الاستبصار، المؤلف: الجزائري، نعمة الله بن عبد الله. تاريخ وفاة المؤلف: ۱۱۱۲ ه. محقق، مصحح: الموسوي الجزائري، طيّب. الناشر: مؤسسة دار الكتاب.‌مكان الطبع: قم. تاريخ الطبع: ۱٤۰۸ ه. الطبعة: الأولى.
۷۹. رياض الأبرار في مناقب الأئمة الأطهار، المؤلف: الجزائري، نعمة الله بن عبد الله. تاريخ وفاة المؤلف: ۱۱۱۲ ه. الناشر: مؤسسة التاريخ العربي. مكان الطبع: بيروت. تاريخ الطبع: ۱٤۲۷ ه. الطبعة: الأولى.
۸۰. رياض السالكين في شرح صحيفة سيّد الساجدين، المؤلف: كبير المدني، السيد علي خان بن أحمد. تاريخ وفاة المؤلف: ۱۱۲۰ ه. محقق، مصحح: الحسيني الأميني، محسن. الناشر: مؤسسة النشر الإسلامي. مكان الطبع: إيران؛ قم. تاريخ الطبع: ۱٤۰۹ ه. الطبعة: الأولى.
۸۱. مستدرك الوسائل ومستنبط المسائل، المؤلف: النورى، حسين بن محمد تقي. تاريخ وفاة المؤلف: ۱۳۲۰ ه. محقق، مصحح: مؤسسة آل البيت%. الناشر: مؤسسة آل البيت%. مكان الطبع: قم. تاريخ الطبع: ۱٤۰۸ ه. الطبعة: الأولى.
۸۲. منهاج البراعة في شرح نهج البلاغة وتكملة منهاج البراعة (للخوئي)، المؤلف: الهاشمي الخوئي، الميرزا حبيب الله. تاريخ وفاة المؤلف: ۱۳۲٤ ه. محقق، مصحح: ميانجي، إبراهيم. الناشر: مكتبة الإسلامية. مكان الطبع: طهران. تاريخ الطبع: ۱٤۰۰ ه.
۸۳. جامع أحاديث الشيعة (للبروجردي)، المؤلف: البروجردي، آغا حسين. تاريخ وفاة المؤلف: ۱۳۸۰ ه. محقق، مصحح: جمع من المحققين. الناشر: منشورات فرهنگ سبز. مكان الطبع: طهران. تاريخ الطبع: ۱٤۲۸ ه. الطبعة: الأولى.
۸٤. الحياة، ترجمة احمد آرام، المؤلف: الحكيمي، محمد رضا والحكيمي، محمد والحكيمي، علي. تاريخ وفاة المؤلف: ۱٤۰۰ ه. المترجم: آرام، أحمد. الناشر: مكتب نشر الثقافة الإسلامية. مكان الطبع: طهران. تاريخ الطبع: ۱٤۲۲ ه. الطبعة: الأولى.
۸٥. نهج الفصاحة، المؤلف: پاينده، أبو القاسم، تاريخ وفاة المؤلف: ۱٤۰٤ ه. الناشر: دنياى دانش. مكان الطبع: طهران. تاريخ الطبع: ۱٤۲٤ ه. الطبعة: الرابعة.
۸٦. مكاتيب الأئمة%، المؤلف: أحمدي ميانجي، علي. تاريخ وفاة المؤلف: ۱٤۲۱ ه. محقق، مصحح: فرجي، مجتبى. الناشر: دار الحديث. مكان الطبع: قم. تاريخ الطبع: ۱٤۲٦ ه. الطبعة: الأولى.

باقي المصادر

۱. الإعجاز والإيجاز، المؤلف: أبو منصور عبد الملك بن محمد بن إسماعيل الثعالبي. تاريخ وفاة المؤلف: ٤۲۹ ه. الناشر: مكتبة القرآن. مكان الطبع: القاهرة.
۲. البخلاء، المؤلف: أبو عثمان عمرو بن بحر الجاحظ. تاريخ وفاة المؤلف: ۲٥٥ ه. الناشر: دار ومكتبة الهلال. مكان الطبع: بيروت. تاريخ الطبع: ۱۹۸۸ م.
۳. بستان الواعظين ورياض السامعين، المؤلف: أبو الفرج عبد الرحمان بن علي ابن الجوزي. تاريخ وفاة المؤلف: ٥۹۷ ه. الناشر: مؤسسة الكتب الثقافية. مكان الطبع: بيروت. الطبعة: الثانية.
 ٤. حياة الحيوان الكبرى، الدميري، المؤلف: كمال الدين محمد بن موسى بن عيسى الدميري. تاريخ وفاة المؤلف: ۸۰۸ ه. الناشر: دار الكتب العلمية. مكان الطبع: بيروت.. تاريخ الطبع: ۲۰۰٤ م، ۱٤۲٤ ه. الطبعة: الأولى.
 ٥. خزائن، النراقي، المؤلف: المولى أحمد النراقي. تاريخ وفاة المؤلف: ۱۲٤٥ ه. الناشر: مؤسسة القيام للنشر. مكان الطبع: طهران. تاريخ الطبع: ۱٤۲۲ ه. الطبعة: الأولى.
 ٦. ديوان السيد الحميري، المؤلف: إسماعيل بن محمد السيد الحميري. تاريخ وفاة المؤلف: ۱۷۳ ه. الناشر: مؤسسة الأعلمي للمطبوعات. مكان الطبع: بيروت. تاريخ الطبع: ۱۹۹۹ م / ۱٤۲۰ ه. الطبعة: الأولى.
 ۷. ديوان الشريف الرضي، المؤلف: محمد بن حسين الشريف الرضي. تاريخ وفاة المؤلف: ٤۰٦ ه. الناشر: دار الجيل. مكان الطبع: بيروت. تاريخ الطبع: ۱۹۹٥ م، ۱٤۱٥ ه. الطبعة: الأولى.
 ۸. ربيع الأبرار ونصوص الأخيار، الزمخشري، المؤلف: جار الله الزمخشري. تاريخ وفاة المؤلف: ٥۳۸ ه. عدد المجلدات: ٥. الناشر: مؤسسة الأعلمي. مكان الطبع: بيروت. تاريخ الطبع: ۱۹۹۹ م، ۱٤۱۲ ه. الطبعة: الأولى.
 ۹. كتاب ألف باء في أنواع الآداب وفنون المحاضرات واللغة، المؤلف: أبو الحجاج يوسف بن محمد البلوي المالقي ابن الشيخ. تاريخ وفاة المؤلف: ٦۰٤ ه. عدد المجلدات: ۲. الناشر: دار الكتب العلمية. مكان الطبع: بيروت. تاريخ الطبع: ۲۰۰۹ م. الطبعة: الأولى.
 ۱۰. كتاب التوابين، ابن قدامة المقدسي، المؤلف: أبو محمد عبد الله بن أحمد بن محمد بن قدامة المقدسي. تاريخ وفاة المؤلف: ٦۲۰ ه. الناشر: مكتبة المؤيد. مكان الطبع: الرياض. تاريخ الطبع: ۱۳۸۹ ه. الطبعة: الثانية.
 ۱۱. الكشكول، البحراني، المؤلف: الشيخ يوسف البحراني. تاريخ وفاة المؤلف: ۱۱۸٦ ه. عدد المجلدات: ۳. الناشر: دار ومكتبة الهلال. مكان الطبع: بيروت. تاريخ الطبع: ۱۹۹۸ م. الطبعة: الأولى.
 ۱۲. كشكول، البهائي، المؤلف: بهاء الدين محمد العاملي البهائي. تاريخ وفاة المؤلف: ۱۰۳۱ ه. عدد المجلدات: ۳. الناشر: الأعلمي. مكان الطبع: بيروت. تاريخ الطبع: ۱۹۸۳ م، ۱٤۰۳ ه. الطبعة: السادسة.
 ۱۳. المستطرف في كل فن مستظرف، الأبشيهي، المؤلف: شهاب الدين محمد بن أحمد أبي الفتح الأبشيهي. تاريخ وفاة المؤلف: ۸٥۲ ه. الناشر: عالم الكتب. مكان الطبع: بيروت. تاريخ الطبع: ۱۹۹۹ م، ۱٤۱۹ ه. الطبعة: الأولى.
 ۱٤. العقد الفريد، ابن عبد ربه، المؤلف: أحمد بن محمد ابن عبد ربه الأندلسي. تاريخ وفاة المؤلف: ۳۲۸ ه.. عدد المجلدات: ۸. الناشر: دار الكتب العلمية. مكان الطبع: بيروت. تاريخ الطبع: ۱٤۰٤ ه. الطبعة: الأولى.
 ۱٥. أعيان الشيعة، السيد محسن الأمين، دار التعارف، بيروت ۱٤۰٦ ه.
 ۱٦. أخلاق أهل البيت%، تألیف السيّد علي الحسيني الميلاني. الناشردليل ما. المطبعة: نگارش.
 ۱۷. التوحيد عند مذهب أهل البيت، تأليف علاء الحسّون.
 ۱۸. بنات النبي& أم ربائبه، تأليف السيد جعفر مرتضى العاملي.
 ۱۹. الصحيح من سيرة الإمام علي#، إسم المؤلف: آية الله المحقق السيد جعفر مرتضى العاملي. عدد الأجزاء ٥۳ جزء. الطبعة الطبعة الأولى. سنة الطبع  ۱٤۲۹ هجري ۲۰۰۹ ميلادي. الناشر المركز الإسلامي للدراسات.
 ۲۰. الصحيح من سيرة النبي الأعظم (ط _ جدید)، تألیف: جعفر مرتضی عامری. الناشر: موسسه علمی فرهنگی دار الحديث، سازمان چاپ و نشر. سنة الطبع: ۱٤۲٦ ق، ۱۳۸٥ ه. ش.
۲۱. حديث الولاية، للسيد علي الحسيني الميلاني. الطبعة الاُولى _ سنة ۱٤۲۱هـ.
۲۲. نفحات القرآن، نويسنده: آيت الله العظمى ناصر مكارم شيرازى دام ظله. تعداد جلد: ۱۰. ناشر: مدرسه الامام على بن ابى طالب#. مكان چاپ: قم. سال چاپ: ۱٤۲٦ ه. ق. نوبت چاپ: اول.
۲۳. تعريب كامل البهائي، تألیف عماد الدين الطبري. الناشر: المكتبة الحيدرية.
۲٤. يوم الخلاص في ظلّ القائم، مؤسسة دار المجتبى للمطبوعات الكتاب: يوم الخلاص. تأليف: كامل سليمان. الطبعة: اولى ۲۰۰٦/۱٤۲۷. المطبعة: برهان.
۲٥. المجالس السنيّة في مناقب ومناصب العترة النبويّة _ ج۱ _ ٤، تألیف: السيد محسن بن عبد الكريم الأمين. الناشردار التعارف للمطبوعات.

۲٦. شخصيات ومواقف، جعفر البياتي. شبكة الإمامين الحسنين^ للتراث والفكر الإسلامي.
۲۷. روضات الجنات فی احوال العلماء و السادات، تألیف: محمدباقر موسوی خوانساری. تاریخ چاپ: ۱۳۹۰ هجری شمسی. ناشر: اسماعیلیان. نوبت چاپ: اول. مكان چاپ: قم.
۲۸. الانوار العلويه، تألیف: نقدی، جعفر، ۱۸۸٥ _ ۱۹٥۱. ناشر: المطبعة الحيدرية في النجف ۱۹٦۲ م _ ۱۳۸۱ ه.
۲۸. المحجة البيضاء، نويسنده: فيض كاشانى، محمد بن شاه مرتضى. تاريخ وفات مؤلف: ۱۰۹۱ ق. تعداد جلد: ۸. ناشر: جماعة المدرسين بقم، موسسه النشر الاسلامي. مكان چاپ: قم. سال چاپ: ۱٤۱۷ ق.. نوبت چاپ: چهارم.
۲۹. مجموعة آثار كتب الشهيد مرتضي المطهري. ناشر: صدرا. قم.
۳۰. من قصص التاريخ، حسيني شيرازي، محمد. الناشر: موسسه تحقيقات و نشر معارف اهل البيت%.
۳۱. قصص وعبر، محمد بن مهدي الحسيني الشيرازي.۱۳۰٥ _ ۱۳۸۰. الناشر: موسسه تحقيقات و نشر معارف اهل البيت%.
۳۲. قصص وخواطر، من أخلاقيات علماء الدين، المؤلف: الشيخ عبدالعظيم المهتدي البحراني. الناشر: موسسة البلاغ. الطبعة الثانية.سنة ۲۰۰۹""");
          }),
          _buildInfoTile(context, 'إصدار', Icons.verified, subtitle: '(1.0.0)'),
          divider(context),
          _buildSectionTitle('تحميل الكتب'),
          for (var i = 1; i <= 6; i++)
            _buildDownloadTile(
                context, 'تحفة الوعاظ المجلد $i', Icons.download),
        ],
      ),
    );
  }

  Divider divider(BuildContext context) {
    return Divider(
      color: Theme.of(context).primaryColor.withOpacity(0.5),
      endIndent: 40,
      indent: 40,
    );
  }

  Widget _buildSectionTitle(String title) {
    return Padding(
      padding: const EdgeInsets.symmetric(vertical: 8),
      child: Text(title,
          style: const TextStyle(fontSize: 18, fontWeight: FontWeight.bold)),
    );
  }

  Widget _buildSwitchTile(BuildContext context, String title, IconData icon) {
    return BlocBuilder<SettingsCubit, SettingsState>(
      builder: (context, state) {
        return SwitchListTile(
          tileColor: Theme.of(context).primaryColor.withOpacity(0.1),
          title: Text(title),
          secondary: Icon(
            icon,
            color: Theme.of(context).colorScheme.secondary,
          ),
          value: state.isDark,
          onChanged: (value) {
            BlocProvider.of<SettingsCubit>(context).changeTheme(value);
          },
          activeColor: Colors.black,
          activeTrackColor: Colors.black54,
          inactiveThumbColor: Colors.blue,
          inactiveTrackColor: Colors.blue[300],
        );
      },
    );
  }

  Widget _buildNavigationTile(
      BuildContext context, String title, IconData icon, VoidCallback onTap) {
    return Padding(
      padding: const EdgeInsets.symmetric(vertical: 2.5),
      child: ListTile(
        tileColor: Theme.of(context).primaryColor.withOpacity(0.1),
        title: Text(title),
        leading: Icon(
          icon,
          color: Theme.of(context).colorScheme.secondary,
        ),
        trailing: Icon(
          Icons.arrow_forward_ios,
          size: 16,
          color: Theme.of(context).colorScheme.secondary,
        ),
        onTap: onTap,
      ),
    );
  }

  Widget _buildInfoTile(BuildContext context, String title, IconData icon,
      {String? subtitle}) {
    return Padding(
      padding: const EdgeInsets.symmetric(vertical: 2.5),
      child: ListTile(
        tileColor: Theme.of(context).primaryColor.withOpacity(0.1),
        title: Text(title),
        subtitle: subtitle != null ? Text(subtitle) : null,
        leading: Icon(
          icon,
          color: Theme.of(context).colorScheme.secondary,
        ),
      ),
    );
  }

  Widget _buildClickableTile(BuildContext context, String title, IconData icon,
      String content, VoidCallback onTap) {
    return ListTile(
      tileColor: Theme.of(context).primaryColor.withOpacity(0.1),
      title: Text(title),
      subtitle: Text(content, style: const TextStyle(color: Colors.blue)),
      leading: Icon(
        icon,
        color: Theme.of(context).colorScheme.secondary,
      ),
      onTap: onTap,
    );
  }

  Widget _buildDownloadTile(BuildContext context, String title, IconData icon) {
    return Padding(
      padding: const EdgeInsets.symmetric(vertical: 2.5),
      child: ListTile(
        tileColor: Theme.of(context).primaryColor.withOpacity(0.1),
        title: Text(title),
        trailing: CircleAvatar(
          radius: 18,
          backgroundColor: Colors.green.shade100,
          child: Icon(
            Icons.download_for_offline_rounded,
            color: Colors.green.shade500,
          ),
        ),
        onTap: () {},
      ),
    );
  }
}
